[{
    "description": "For this side scroller, we will use the starting cat sprite. By clicking on the costume tab, we can see that there are two images for the cat sprite.",
    "image": "BlankWindow2.PNG"
},
{
    "description": "Those two 'costumes' are the images the cat sprite can switch between the two. By switching between the two costumes, the sprite will give the impression of movement. So, to start, we want to grab the block 'next costume' under the look category.",
    "image": "NextCostume.PNG"
},
{
    "description": "We do want a hesitation between the costume changes to make sure that the switching isn't going too fast. We will grab the 'wait 1 sec' block, under the control category, and place it on top of the 'next costume' block. We will then change the time to 0.25",
    "image": "WaitCostume.PNG"
},
{
    "description": "Because 1 sec is too long, we will change the value to 0.25",
    "image": "ChangeWaitCostume.PNG"
},
{
    "description": "To initiate the sprite movement, we need a way to start the script. Going to the event categoy, we will use the 'when space key pressed' and attach it to the top of the block stack.",
    "image": "StartCat.PNG"
},
{
    "description": "We will select the downward triangle next to the word space to get the drop down window. And we will select 'right arrow'.",
    "image": "DropDownCostume.PNG"
},
{
	"description": "Now the cat sprite and script has been completed, we can work on the rest of the scene.",
	"image": "CatCostumeScript.PNG"
},
{
    "description": "Now we will create a new sprite by clicking the 'choose sprite from library' button in the sprite area.",
    "image": "NewSprite.png"
},
{
	"description": "We are going to use a sprite image already in the library for some background scenery.  Select the cloud image to create a cloud sprite.",
	"image": "Cloud1Sprite.PNG"
},
{
	"description": "We are going to click and hold the image of the cloud in the Stage area, and drag it up to the upper left side for placement.",
	"image": "Cloud1Placement.PNG"
},
{
	"description": "This cloud is going to be rolling by in the side scroller, so we will need to add a script to the sprite. Every sprite can have its own script to act independently from other sprites. For this cloud, we want it to start the movement the same time the cat sprite moves. So we grab the same event block as the cat sprite.",
	"image": "Cloud1Start.PNG"
},
{
	"description": "The cloud will be moving, so we will grab the 'change x by []' block from the Motion category and attach it to our starting block.",
	"image": "Cloud1Move.PNG"
},
{
	"description": "We will change the value of x to change by a -1 because we want the cloud to move to the left while the cat sprite looks like it is moving to the right. We then grab the 'if' block from the control category and add it to the stack.",
	"image": "Cloud1If.PNG"
},
{
	"description": "",
	"image":
},
{
	"description": "",
	"image":
},
{
	"description": "",
	"image":
},
{
	"description": "",
	"image":
},
{
	"description": "",
	"image":
},
{
	"description": "",
	"image":
},
{
	"description": "",
	"image":
},
{
	"description": "",
	"image":
}]